## sso_proxy
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 50 to add, 2 to change, 43 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.pomerium_sso_proxy will be created
  + resource "aws_ecs_service" "pomerium_sso_proxy" {
      + cluster                            = "arn:aws:ecs:ca-central-1:794722365809:cluster/pomerium_sso_proxy"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + health_check_grace_period_seconds  = 600
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "pomerium_sso_proxy"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "pomerium_sso_proxy"
          + container_port   = 443
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # aws_ecs_service.pomerium_sso_proxy_auth will be created
  + resource "aws_ecs_service" "pomerium_sso_proxy_auth" {
      + cluster                            = "arn:aws:ecs:ca-central-1:794722365809:cluster/pomerium_sso_proxy_auth"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "pomerium_sso_proxy_auth"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }

      + service_registries {
          + registry_arn = (known after apply)
        }
    }

  # aws_ecs_task_definition.pomerium_sso_proxy will be created
  + resource "aws_ecs_task_definition" "pomerium_sso_proxy" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "AUTHENTICATE_SERVICE_URL"
                          + value = "https://auth.security.cdssandbox.xyz"
                        },
                      + {
                          + name  = "AUTOCERT"
                          + value = "FALSE"
                        },
                      + {
                          + name  = "IDP_PROVIDER"
                          + value = "google"
                        },
                      + {
                          + name  = "INSECURE_SERVER"
                          + value = "true"
                        },
                      + {
                          + name  = "LOG_LEVEL"
                          + value = "debug"
                        },
                      + {
                          + name  = "ROUTES"
                          + value = "cm91dGVzOgogIC0gZnJvbTogaHR0cHM6Ly9hdXRoLnNlY3VyaXR5LmNkc3NhbmRib3gueHl6CiAgICB0bzogaHR0cDovL2F1dGguNzk0NzIyMzY1ODA5LmxvY2FsOjgwMDAKICAgIGFsbG93ZWRfZG9tYWluczoKICAgICAgLSBzZWN1cml0eS5jZHNzYW5kYm94Lnh5egogICAgY29yc19hbGxvd19wcmVmbGlnaHQ6IHRydWUKICAgIHRpbWVvdXQ6IDMwcw=="
                        },
                    ]
                  + essential        = true
                  + image            = "pomerium/pomerium:git-74310b3d"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/pomerium_sso_proxy"
                          + awslogs-region        = "ca-central-1"
                          + awslogs-stream-prefix = "pomerium_sso_proxy-task"
                        }
                    }
                  + name             = "pomerium_sso_proxy"
                  + portMappings     = [
                      + {
                          + containerPort = 443
                          + hostPort      = 443
                          + protocol      = "tcp"
                        },
                    ]
                  + secrets          = [
                      + {
                          + name      = "SHARED_SECRET"
                          + valueFrom = "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_client_id"
                        },
                      + {
                          + name      = "COOKIE_SECRET"
                          + valueFrom = "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_client_secret"
                        },
                      + {
                          + name      = "IDP_CLIENT_ID"
                          + valueFrom = "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_google_client_id"
                        },
                      + {
                          + name      = "IDP_CLIENT_SECRET"
                          + valueFrom = "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_google_client_secret"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "2048"
      + execution_role_arn       = "arn:aws:iam::794722365809:role/container_execution_role"
      + family                   = "pomerium_sso_proxy"
      + id                       = (known after apply)
      + memory                   = "4096"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + tags_all                 = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + task_role_arn            = "arn:aws:iam::794722365809:role/pomerium_execution_role"
    }

  # aws_ecs_task_definition.pomerium_sso_proxy_auth will be created
  + resource "aws_ecs_task_definition" "pomerium_sso_proxy_auth" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "IDP_PROVIDER"
                          + value = "google"
                        },
                      + {
                          + name  = "LOG_LEVEL"
                          + value = "debug"
                        },
                    ]
                  + essential        = true
                  + image            = "pomerium/verify:sha-6b38dd5"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/pomerium_sso_proxy_auth"
                          + awslogs-region        = "ca-central-1"
                          + awslogs-stream-prefix = "pomerium_sso_proxy_auth-task"
                        }
                    }
                  + name             = "pomerium_sso_proxy_auth"
                  + portMappings     = [
                      + {
                          + containerPort = 8000
                          + hostPort      = 8000
                          + protocol      = "tcp"
                        },
                    ]
                  + secrets          = [
                      + {
                          + name      = "SHARED_SECRET"
                          + valueFrom = "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_client_id"
                        },
                      + {
                          + name      = "COOKIE_SECRET"
                          + valueFrom = "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_client_secret"
                        },
                      + {
                          + name      = "IDP_CLIENT_ID"
                          + valueFrom = "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_google_client_id"
                        },
                      + {
                          + name      = "IDP_CLIENT_SECRET"
                          + valueFrom = "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_google_client_secret"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "1024"
      + execution_role_arn       = "arn:aws:iam::794722365809:role/container_execution_role"
      + family                   = "pomerium_sso_proxy_auth"
      + id                       = (known after apply)
      + memory                   = "2048"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + tags_all                 = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + task_role_arn            = "arn:aws:iam::794722365809:role/pomerium_execution_role"
    }

  # aws_flow_log.cloud-based-sensor must be replaced
-/+ resource "aws_flow_log" "cloud-based-sensor" {
      ~ arn                      = "arn:aws:ec2:ca-central-1:794722365809:vpc-flow-log/fl-0b60e585ae67b58af" -> (known after apply)
      ~ id                       = "fl-0b60e585ae67b58af" -> (known after apply)
      + log_group_name           = (known after apply)
        tags                     = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools"
            "Terraform"  = "true"
        }
      ~ vpc_id                   = "vpc-01e74320ce5d3c924" -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)

      - destination_options {
          - file_format                = "plain-text" -> null
          - hive_compatible_partitions = false -> null
          - per_hour_partition         = false -> null
        }
    }

  # aws_iam_role_policy_attachment.ecs_container_registery_policies will be created
  + resource "aws_iam_role_policy_attachment" "ecs_container_registery_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonECSTaskExecutionRolePolicy"
      + role       = "pomerium_execution_role"
    }

  # aws_lb.pomerium will be updated in-place
  ~ resource "aws_lb" "pomerium" {
        id                         = "arn:aws:elasticloadbalancing:ca-central-1:794722365809:loadbalancer/app/pomerium-sso/955b3ea161657eb2"
        name                       = "pomerium-sso"
      ~ security_groups            = [
          - "sg-0f2a305ad220f0ec1",
        ] -> (known after apply)
      ~ subnets                    = [
          - "subnet-020bc18c46651d615",
          - "subnet-058a5e810449aa1e4",
          - "subnet-0882f90455a42facd",
        ] -> (known after apply)
        tags                       = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools"
            "Terraform"  = "true"
        }
        # (15 unchanged attributes hidden)


        # (4 unchanged blocks hidden)
    }

  # aws_lb_listener.https will be created
  + resource "aws_lb_listener" "https" {
      + arn               = (known after apply)
      + certificate_arn   = "arn:aws:acm:ca-central-1:794722365809:certificate/fd72956c-0bf0-4fae-91e4-372e5e0ef85f"
      + id                = (known after apply)
      + load_balancer_arn = "arn:aws:elasticloadbalancing:ca-central-1:794722365809:loadbalancer/app/pomerium-sso/955b3ea161657eb2"
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-FS-1-2-Res-2020-10"
      + tags              = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_listener_certificate.https_sni will be created
  + resource "aws_lb_listener_certificate" "https_sni" {
      + certificate_arn = "arn:aws:acm:ca-central-1:794722365809:certificate/fd72956c-0bf0-4fae-91e4-372e5e0ef85f"
      + id              = (known after apply)
      + listener_arn    = (known after apply)
    }

  # aws_lb_target_group.ecs must be replaced
-/+ resource "aws_lb_target_group" "ecs" {
      ~ arn                                = "arn:aws:elasticloadbalancing:ca-central-1:794722365809:targetgroup/ecs/d1153e64c25198f9" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/ecs/d1153e64c25198f9" -> (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:ca-central-1:794722365809:targetgroup/ecs/d1153e64c25198f9" -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
        name                               = "ecs"
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
        tags                               = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools"
            "Terraform"  = "true"
        }
      ~ vpc_id                             = "vpc-01e74320ce5d3c924" -> (known after apply) # forces replacement
        # (9 unchanged attributes hidden)


      ~ stickiness {
          ~ cookie_duration = 86400 -> (known after apply)
          + cookie_name     = (known after apply)
          ~ enabled         = false -> (known after apply)
          ~ type            = "lb_cookie" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # aws_security_group.pomerium must be replaced
-/+ resource "aws_security_group" "pomerium" {
      ~ arn                    = "arn:aws:ec2:ca-central-1:794722365809:security-group/sg-0f2a305ad220f0ec1" -> (known after apply)
      ~ id                     = "sg-0f2a305ad220f0ec1" -> (known after apply)
        name                   = "pomerium"
      + name_prefix            = (known after apply)
      ~ owner_id               = "794722365809" -> (known after apply)
        tags                   = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools"
            "Terraform"  = "true"
        }
      ~ vpc_id                 = "vpc-01e74320ce5d3c924" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # aws_service_discovery_private_dns_namespace.internal must be replaced
-/+ resource "aws_service_discovery_private_dns_namespace" "internal" {
      ~ arn         = "arn:aws:servicediscovery:ca-central-1:794722365809:namespace/ns-c53aonlaox6l5thh" -> (known after apply)
      ~ hosted_zone = "Z10470893W2697AS3ZHX" -> (known after apply)
      ~ id          = "ns-c53aonlaox6l5thh" -> (known after apply)
        name        = "794722365809.local"
        tags        = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools"
            "Terraform"  = "true"
        }
      ~ vpc         = "vpc-01e74320ce5d3c924" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_service_discovery_service.auth must be replaced
-/+ resource "aws_service_discovery_service" "auth" {
      ~ arn           = "arn:aws:servicediscovery:ca-central-1:794722365809:service/srv-e7jhv6q4gmws2guf" -> (known after apply)
      ~ id            = "srv-e7jhv6q4gmws2guf" -> (known after apply)
        name          = "auth"
      ~ namespace_id  = "ns-c53aonlaox6l5thh" -> (known after apply)
        tags          = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools"
            "Terraform"  = "true"
        }
        # (2 unchanged attributes hidden)

      ~ dns_config {
          ~ namespace_id   = "ns-c53aonlaox6l5thh" -> (known after apply) # forces replacement
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_default_network_acl.default must be replaced
-/+ resource "aws_default_network_acl" "default" {
      ~ arn                    = "arn:aws:ec2:ca-central-1:794722365809:network-acl/acl-085d7fb528bc7d1bf" -> (known after apply)
      ~ default_network_acl_id = "acl-085d7fb528bc7d1bf" -> (known after apply) # forces replacement
      ~ id                     = "acl-085d7fb528bc7d1bf" -> (known after apply)
      ~ owner_id               = "794722365809" -> (known after apply)
      - subnet_ids             = [] -> null
        tags                   = {
            "CostCentre" = "security-tools-794722365809"
            "Name"       = "security-tools_default_nacl"
            "Terraform"  = "true"
        }
      ~ vpc_id                 = "vpc-01e74320ce5d3c924" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_default_route_table.default must be replaced
-/+ resource "aws_default_route_table" "default" {
      ~ arn                    = "arn:aws:ec2:ca-central-1:794722365809:route-table/rtb-05a4819c46bb0e0d4" -> (known after apply)
      ~ default_route_table_id = "rtb-05a4819c46bb0e0d4" -> (known after apply) # forces replacement
      ~ id                     = "rtb-05a4819c46bb0e0d4" -> (known after apply)
      ~ owner_id               = "794722365809" -> (known after apply)
      - propagating_vgws       = [] -> null
        tags                   = {
            "CostCentre" = "security-tools-794722365809"
            "Terraform"  = "true"
            "name"       = "security-tools_default_route_table"
        }
      ~ vpc_id                 = "vpc-01e74320ce5d3c924" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.vpc.aws_default_security_group.default must be replaced
-/+ resource "aws_default_security_group" "default" {
      ~ arn                    = "arn:aws:ec2:ca-central-1:794722365809:security-group/sg-005d17c13f976db6a" -> (known after apply)
      ~ description            = "default VPC security group" -> (known after apply)
      ~ egress                 = [] -> (known after apply)
      ~ id                     = "sg-005d17c13f976db6a" -> (known after apply)
      ~ ingress                = [] -> (known after apply)
      ~ name                   = "default" -> (known after apply)
      ~ owner_id               = "794722365809" -> (known after apply)
        tags                   = {
            "CostCentre" = "security-tools-794722365809"
            "Name"       = "security-tools_default_sg"
            "Terraform"  = "true"
        }
      ~ vpc_id                 = "vpc-01e74320ce5d3c924" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.vpc.aws_internet_gateway.gw will be updated in-place
  ~ resource "aws_internet_gateway" "gw" {
        id       = "igw-03961f3d12a6c07d6"
        tags     = {
            "CostCentre" = "security-tools-794722365809"
            "Name"       = "security-tools_internet_gateway"
            "Terraform"  = "true"
        }
      ~ vpc_id   = "vpc-01e74320ce5d3c924" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.nat_gw[0] must be replaced
-/+ resource "aws_nat_gateway" "nat_gw" {
      ~ id                   = "nat-0b88b334a2f674c83" -> (known after apply)
      ~ network_interface_id = "eni-0e946e0fd6144a094" -> (known after apply)
      ~ private_ip           = "172.16.3.190" -> (known after apply)
      ~ public_ip            = "3.98.72.209" -> (known after apply)
      ~ subnet_id            = "subnet-058a5e810449aa1e4" -> (known after apply) # forces replacement
        tags                 = {
            "CostCentre" = "security-tools-794722365809"
            "Name"       = "security-tools-natgw-0"
            "Terraform"  = "true"
        }
        # (3 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.nat_gw[1] must be replaced
-/+ resource "aws_nat_gateway" "nat_gw" {
      ~ id                   = "nat-0d74c525548ab1d74" -> (known after apply)
      ~ network_interface_id = "eni-0d3a56f23afaddf9a" -> (known after apply)
      ~ private_ip           = "172.16.30.161" -> (known after apply)
      ~ public_ip            = "3.99.89.95" -> (known after apply)
      ~ subnet_id            = "subnet-020bc18c46651d615" -> (known after apply) # forces replacement
        tags                 = {
            "CostCentre" = "security-tools-794722365809"
            "Name"       = "security-tools-natgw-1"
            "Terraform"  = "true"
        }
        # (3 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.nat_gw[2] must be replaced
-/+ resource "aws_nat_gateway" "nat_gw" {
      ~ id                   = "nat-0550885219c422458" -> (known after apply)
      ~ network_interface_id = "eni-0fc8efe06887db466" -> (known after apply)
      ~ private_ip           = "172.16.33.60" -> (known after apply)
      ~ public_ip            = "3.99.64.49" -> (known after apply)
      ~ subnet_id            = "subnet-0882f90455a42facd" -> (known after apply) # forces replacement
        tags                 = {
            "CostCentre" = "security-tools-794722365809"
            "Name"       = "security-tools-natgw-2"
            "Terraform"  = "true"
        }
        # (3 unchanged attributes hidden)
    }

  # module.vpc.aws_network_acl.main must be replaced
-/+ resource "aws_network_acl" "main" {
      ~ arn        = "arn:aws:ec2:ca-central-1:794722365809:network-acl/acl-03e1a3ee25083161a" -> (known after apply)
      ~ egress     = [
          - {
              - action          = "allow"
              - cidr_block      = "0.0.0.0/0"
              - from_port       = 1024
              - icmp_code       = 0
              - icmp_type       = 0
              - ipv6_cidr_block = ""
              - protocol        = "6"
              - rule_no         = 73
              - to_port         = 65535
            },
          - {
              - action          = "allow"
              - cidr_block      = "0.0.0.0/0"
              - from_port       = 443
              - icmp_code       = 0
              - icmp_type       = 0
              - ipv6_cidr_block = ""
              - protocol        = "6"
              - rule_no         = 60
              - to_port         = 443
            },
          - {
              - action          = "allow"
              - cidr_block      = "172.16.0.0/16"
              - from_port       = 1024
              - icmp_code       = 0
              - icmp_type       = 0
              - ipv6_cidr_block = ""
              - protocol        = "6"
              - rule_no         = 61
              - to_port         = 65535
            },
          - {
              - action          = "allow"
              - cidr_block      = "172.16.0.0/16"
              - from_port       = 443
              - icmp_code       = 0
              - icmp_type       = 0
              - ipv6_cidr_block = ""
              - protocol        = "6"
              - rule_no         = 72
              - to_port         = 443
            },
        ] -> (known after apply)
      ~ id         = "acl-03e1a3ee25083161a" -> (known after apply)
      ~ ingress    = [
          - {
              - action          = "allow"
              - cidr_block      = "0.0.0.0/0"
              - from_port       = 1024
              - icmp_code       = 0
              - icmp_type       = 0
              - ipv6_cidr_block = ""
              - protocol        = "6"
              - rule_no         = 63
              - to_port         = 65535
            },
          - {
              - action          = "allow"
              - cidr_block      = "0.0.0.0/0"
              - from_port       = 443
              - icmp_code       = 0
              - icmp_type       = 0
              - ipv6_cidr_block = ""
              - protocol        = "6"
              - rule_no         = 70
              - to_port         = 443
            },
          - {
              - action          = "allow"
              - cidr_block      = "172.16.0.0/16"
              - from_port       = 1024
              - icmp_code       = 0
              - icmp_type       = 0
              - ipv6_cidr_block = ""
              - protocol        = "6"
              - rule_no         = 71
              - to_port         = 65535
            },
          - {
              - action          = "allow"
              - cidr_block      = "172.16.0.0/16"
              - from_port       = 443
              - icmp_code       = 0
              - icmp_type       = 0
              - ipv6_cidr_block = ""
              - protocol        = "6"
              - rule_no         = 62
              - to_port         = 443
            },
          - {
              - action          = "deny"
              - cidr_block      = "172.16.0.0/16"
              - from_port       = 22
              - icmp_code       = 0
              - icmp_type       = 0
              - ipv6_cidr_block = ""
              - protocol        = "6"
              - rule_no         = 50
              - to_port         = 22
            },
          - {
              - action          = "deny"
              - cidr_block      = "172.16.0.0/16"
              - from_port       = 3389
              - icmp_code       = 0
              - icmp_type       = 0
              - ipv6_cidr_block = ""
              - protocol        = "6"
              - rule_no         = 51
              - to_port         = 3389
            },
        ] -> (known after apply)
      ~ owner_id   = "794722365809" -> (known after apply)
      ~ subnet_ids = [
          - "subnet-01816f469be35348a",
          - "subnet-020bc18c46651d615",
          - "subnet-058a5e810449aa1e4",
          - "subnet-07694bb7edd0d9c18",
          - "subnet-07af857c5b3194e1b",
          - "subnet-0882f90455a42facd",
        ] -> (known after apply)
        tags       = {
            "CostCentre" = "security-tools-794722365809"
            "Name"       = "security-tools_main_nacl"
            "Terraform"  = "true"
        }
      ~ vpc_id     = "vpc-01e74320ce5d3c924" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_network_acl_rule.block_rdp[0] must be replaced
-/+ resource "aws_network_acl_rule" "block_rdp" {
      ~ cidr_block     = "172.16.0.0/16" -> "172.16.0.0/25" # forces replacement
      ~ id             = "nacl-3650910607" -> (known after apply)
      ~ network_acl_id = "acl-03e1a3ee25083161a" -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.vpc.aws_network_acl_rule.block_ssh[0] must be replaced
-/+ resource "aws_network_acl_rule" "block_ssh" {
      ~ cidr_block     = "172.16.0.0/16" -> "172.16.0.0/25" # forces replacement
      ~ id             = "nacl-1111045600" -> (known after apply)
      ~ network_acl_id = "acl-03e1a3ee25083161a" -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.vpc.aws_network_acl_rule.https_request_egress_443[0] must be replaced
-/+ resource "aws_network_acl_rule" "https_request_egress_443" {
      ~ id             = "nacl-390643960" -> (known after...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

17 tests, 17 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
